# In-Class Exercises 2/2

## Task 1

In [1]:
import pandas as pd

data1 = {
    'StudentID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
}

df1 = pd.DataFrame(data1)

data2 = {
    'StudentID': [3, 4, 5, 6],
    'Grade': ['A', 'B', 'C', 'D']
}

df2 = pd.DataFrame(data2)

In [2]:
# Inner join
pd.merge(df1, df2, how='inner')

   StudentID     Name Grade
0          3  Charlie     A
1          4    David     B

In [3]:
# Outer join
pd.merge(df1, df2, how='outer')

   StudentID     Name Grade
0          1    Alice   NaN
1          2      Bob   NaN
2          3  Charlie     A
3          4    David     B
4          5      NaN     C
5          6      NaN     D

In [14]:
# Left join
pd.merge(df1, df2, on=['StudentID'], how='left')

   StudentID     Name Grade
0          1    Alice   NaN
1          2      Bob   NaN
2          3  Charlie     A
3          4    David     B

In [15]:
# Right join
pd.merge(df1, df2, on=['StudentID'], how='right')

   StudentID     Name Grade
0          3  Charlie     A
1          4    David     B
2          5      NaN     C
3          6      NaN     D

## Task 2

In [8]:
data = {
    'Salesperson': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Product': ['Widget', 'Widget', 'Gadget', 'Gadget', 'Widget', 'Gadget'],
    'Quantity': [4, 2, 3, 5, 6, 1]
}

df = pd.DataFrame(data)
df

  Salesperson Product  Quantity
0       Alice  Widget         4
1         Bob  Widget         2
2     Charlie  Gadget         3
3       Alice  Gadget         5
4         Bob  Widget         6
5     Charlie  Gadget         1

In [10]:
grouped_salesperson = df.groupby('Salesperson')

sum_by_salesperson = grouped_salesperson['Quantity'].sum()

print(sum_by_salesperson)

Salesperson
Alice      9
Bob        8
Charlie    4
Name: Quantity, dtype: int64

In [12]:
grouped_product = df.groupby('Product')

average_quantity_sold = grouped_product['Quantity'].mean()

print(average_quantity_sold)

Product
Gadget    3.0
Widget    4.0
Name: Quantity, dtype: float64